'use client';

import DocumentLayout from '../components/DocumentLayout';

export default function PrivacyPolicy() {
  return (
    <DocumentLayout title="Политика конфиденциальности">
      <h2>1. Общие положения</h2>
      <p>
        Настоящая политика конфиденциальности описывает принципы обработки и
        защиты информации о физических лицах, которая может быть получена при
        использовании сайта.
      </p>

      <h2>2. Состав обрабатываемых персональных данных</h2>
      <p>Мы собираем и обрабатываем следующие персональные данные:</p>
      <ul>
        <li>Номер телефона</li>
        <li>Имя (при предоставлении)</li>
        <li>Адрес электронной почты (при предоставлении)</li>
        <li>Адрес объекта экспертизы (при заказе услуг)</li>
      </ul>

      <h2>3. Цели обработки персональных данных</h2>
      <p>Мы обрабатываем ваши персональные данные для следующих целей:</p>
      <ul>
        <li>Оказание услуг по проведению экспертизы</li>
        <li>Информирование о статусе заказа</li>
        <li>Консультирование по услугам</li>
        <li>Улучшение качества обслуживания</li>
      </ul>

      <h2>4. Принципы обработки персональных данных</h2>
      <p>
        Обработка персональных данных осуществляется на основе следующих
        принципов:
      </p>
      <ul>
        <li>Законность и справедливость</li>
        <li>Ограничение обработки конкретными целями</li>
        <li>
          Соответствие содержания и объема обрабатываемых данных заявленным
          целям
        </li>
        <li>Точность и актуальность данных</li>
      </ul>

      <h2>5. Меры по защите персональных данных</h2>
      <p>
        Мы принимаем необходимые и достаточные организационные и технические
        меры для защиты персональных данных от неправомерного доступа,
        уничтожения, изменения, блокирования, копирования, распространения, а
        также от иных неправомерных действий с ней третьих лиц.
      </p>

      <h2>6. Права пользователей</h2>
      <p>Пользователи имеют право:</p>
      <ul>
        <li>Получать информацию об обработке персональных данных</li>
        <li>Требовать уточнения или удаления персональных данных</li>
        <li>Отзывать согласие на обработку персональных данных</li>
        <li>Обжаловать действия или бездействие оператора</li>
      </ul>

      <h2>7. Изменение политики конфиденциальности</h2>
      <p>
        Мы оставляем за собой право вносить изменения в политику
        конфиденциальности. При внесении изменений в актуальной редакции
        указывается дата последнего обновления. Новая редакция политики вступает
        в силу с момента ее размещения на сайте.
      </p>

      <h2>8. Контактная информация</h2>
      <p>
        По всем вопросам, связанным с обработкой персональных данных, можно
        обращаться:
      </p>
      <ul>
        <li>По телефону: +7 (916) 830-58-58</li>
        <li>По email: ckeproekt@yandex.ru</li>
      </ul>
    </DocumentLayout>
  );
}
